tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Cross-platform make
brew "cmake"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Fast, highly customisable system info script
brew "neofetch"
# Platform built on V8 to build network applications
brew "node"
# Python version management
brew "pyenv"
# File browser
brew "ranger"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# General-purpose lossless data-compression library
brew "zlib"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3", link: false
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern, maintained replacement for ls
brew "eza"
# Simple terminal UI for git commands
brew "lazygit"
# Application uninstaller
cask "appcleaner"
# App to build and share containerized applications and microservices
cask "docker"
# NeoVim
brew "neovim"
# Ghostty is a modern, fast, and secure password manager
cask "ghostty"
