tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# Library for command-line editing
brew "readline"
# Cross-platform make
brew "cmake"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# Fast, highly customisable system info script
brew "neofetch"
# Platform built on V8 to build network applications
brew "node"
# Python version management
brew "pyenv"
# File browser
brew "ranger"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Terminal multiplexer
brew "tmux"
# Plugin manager for tmux
brew "tpm"
# Access X11 clipboards from the command-line
brew "xclip"
# General-purpose lossless data-compression library
brew "zlib"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3", link: false
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Modern, maintained replacement for ls
brew "eza"
# Simple terminal UI for git commands
brew "lazygit"
# Application uninstaller
cask "appcleaner"
# App to build and share containerized applications and microservices
cask "docker"
# Developer targeted fonts with a high number of glyphs
cask "font-hack-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-jetbrains-mono-nerd-font"
# Developer targeted fonts with a high number of glyphs
cask "font-symbols-only-nerd-font"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
